---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingSlope
source: html/f0c5e0e7-3d7b-d66a-de4e-bab378d84230.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingSlope Property

Slope, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingSlope { get; }
```